# Series

In [1]:
import numpy as np
import pandas as pd

In [4]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={"a":10,"b":20,"c":30}
my_data

[10, 20, 30]

In [3]:
arr

array([10, 20, 30])

In [9]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [13]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
d

{'a': 10, 'b': 20, 'c': 30}

In [15]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [16]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [17]:
ser1=pd.Series([1,2,3,4],["India","japan","sass","asdsd"])
ser1

India    1
japan    2
sass     3
asdsd    4
dtype: int64

In [18]:
ser2=pd.Series([1,2,5,6],["India","japan","sad","sdsadas"])
ser2

India      1
japan      2
sad        5
sdsadas    6
dtype: int64

In [19]:
ser1["India"]

1

In [20]:
ser3=pd.Series(data=labels)

In [22]:
ser3[0]

'a'

In [23]:
ser1

India    1
japan    2
sass     3
asdsd    4
dtype: int64

In [24]:
ser2

India      1
japan      2
sad        5
sdsadas    6
dtype: int64

In [25]:
ser1+ser2

India      2.0
asdsd      NaN
japan      4.0
sad        NaN
sass       NaN
sdsadas    NaN
dtype: float64

# Pandas -DataFrames

In [32]:
from numpy.random import randn
np.random.seed(101)
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df['W']>0

A    True
B    True
C    True
D    True
E    True
Name: W, dtype: bool

In [35]:
df

     W         X         Y         Z
A  2.7  0.628133  0.907969  0.503826
B  2.7 -0.319318 -0.848077  0.605965
C  2.7  0.740122  0.528813 -0.589001
D  2.7 -0.758872 -0.933237  0.955057
E  2.7  1.978757  2.605967  0.683509

In [37]:
df.reset_index()

  index    W         X         Y         Z
0     A  2.7  0.628133  0.907969  0.503826
1     B  2.7 -0.319318 -0.848077  0.605965
2     C  2.7  0.740122  0.528813 -0.589001
3     D  2.7 -0.758872 -0.933237  0.955057
4     E  2.7  1.978757  2.605967  0.683509

In [38]:
new="sf ca fg sr st".split()

In [39]:
new

['sf', 'ca', 'fg', 'sr', 'st']

In [40]:
df["states"]=new

In [41]:
df

     W         X         Y         Z states
A  2.7  0.628133  0.907969  0.503826     sf
B  2.7 -0.319318 -0.848077  0.605965     ca
C  2.7  0.740122  0.528813 -0.589001     fg
D  2.7 -0.758872 -0.933237  0.955057     sr
E  2.7  1.978757  2.605967  0.683509     st

In [43]:
df.set_index('states')

          W         X         Y         Z
states
sf      2.7  0.628133  0.907969  0.503826
ca      2.7 -0.319318 -0.848077  0.605965
fg      2.7  0.740122  0.528813 -0.589001
sr      2.7 -0.758872 -0.933237  0.955057
st      2.7  1.978757  2.605967  0.683509

In [53]:
#index levels
outside=["G1","G1","G1","G2","G2","G2"]
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [54]:
df=pd.DataFrame(randn(6,2),hier_index,["A","B"])

In [55]:
df

             A         B
G1 1 -1.005187 -0.741790
   2  0.187125 -0.732845
   3 -1.382920  1.482495
G2 1  0.961458 -2.141212
   2  0.992573  1.192241
   3 -1.046780  1.292765

In [56]:
df.loc['G2'].loc[2]['B']

1.1922406372754866

In [57]:
df.xs('G1')

          A         B
1 -1.005187 -0.741790
2  0.187125 -0.732845
3 -1.382920  1.482495

# Missing Value

In [62]:
d={'A':[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}

In [63]:
df=pd.DataFrame(d)

In [64]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [66]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [67]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [69]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [71]:
df.fillna(value="Fill Value")

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [80]:
df["A"].fillna(value="B")

0    1
1    2
2    B
Name: A, dtype: object

In [84]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Group By

In [11]:
data={"Company":["Goog","Goog","Msit","Msit","fb","fb"],"person":["sam","charlie","amy","vanessa","carl","sarah"],"sales":[200,120,340,124,243,350]}

In [12]:
df=pd.DataFrame(data)

In [13]:
df

  Company   person  sales
0    Goog      sam    200
1    Goog  charlie    120
2    Msit      amy    340
3    Msit  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [17]:
bycomp=df.groupby("Company")

In [18]:
bycomp.mean() #returns mean of int value

         sales
Company
Goog     160.0
Msit     232.0
fb       296.5

In [19]:
bycomp.sum()

         sales
Company
Goog       320
Msit       464
fb         593

In [20]:
bycomp.std()

              sales
Company
Goog      56.568542
Msit     152.735065
fb        75.660426

In [21]:
bycomp.sum().loc["fb"]

sales    593
Name: fb, dtype: int64

In [23]:
df.groupby("Company").sum().loc["fb"]

sales    593
Name: fb, dtype: int64

In [24]:
df.groupby("Company").max()

          person  sales
Company
Goog         sam    200
Msit     vanessa    340
fb         sarah    350

In [25]:
df.groupby("Company").min()

          person  sales
Company
Goog     charlie    120
Msit         amy    124
fb          carl    243

In [26]:
df.groupby("Company").describe()

        sales
        count   mean         std    min     25%    50%     75%    max
Company
Goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Msit      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0

In [27]:
df.groupby("Company").describe().transpose()

Company            Goog        Msit          fb
sales count    2.000000    2.000000    2.000000
      mean   160.000000  232.000000  296.500000
      std     56.568542  152.735065   75.660426
      min    120.000000  124.000000  243.000000
      25%    140.000000  178.000000  269.750000
      50%    160.000000  232.000000  296.500000
      75%    180.000000  286.000000  323.250000
      max    200.000000  340.000000  350.000000

In [30]:
df.groupby("Company").describe().transpose()["fb"]

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: fb, dtype: float64

# Merging joining and concatenation